TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ОбработкаЗагрузкиВнешнихПроб/гкс_ОбработкаЗагрузкиВнешнихПроб.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>гкс_ОбработкаЗагрузкиВнешнихПроб</name>
  <attributes>
    <name>ПерваяСтрокаДанныхТабличногоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаИсточника</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧастьИсточника</name>
  </attributes>
  <attributes>
    <name>ПередЗаписьюОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриЗаписиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПослеДобавленияСтроки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВидаРегистра</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗамещатьСуществующиеЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеСвойства</name>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиКачестваWarehouse</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПробы</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ВнешниеПробыПоЗаявкамНаПеревозку/гкс_ВнешниеПробыПоЗаявкамНаПеревозку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ВнешниеПробыПоЗаявкамНаПеревозку</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВнешняяПроба</name>
    <type>
      <types>DocumentRef.гкс_ВнешняяПроба</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоказателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НомерЗерновоза</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <comment>Для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтанцияОтправления</name>
    <type>
      <types>CatalogRef.гкс_КлассификаторСтанцийЖД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сюрвейер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НазначениеИспользованияКачества</name>
    <type>
      <types>EnumRef.гкс_НазначенияИспользованияКачества</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.гкс_ПоказателиАнализовНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/DataProcessors/гкс_ОбработкаЗагрузкиВнешнихПроб/Forms/ФормаСравнения/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяМакета 		= "ШаблонСравненияПоказателей";
	Макет 			= Обработки.гкс_ОбработкаЗагрузкиВнешнихПроб.ПолучитьМакет(ИмяМакета);
	ОбластьМакета 	= Макет.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета 	= Макет.ПолучитьОбласть("Строка");
	ТабличныйДокументДанные.Вывести(ОбластьМакета);	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьАнализ(Команда)
	Если ПроверитьЗаполнение() Тогда 
		ВыполнитьАнализНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сбросить(Команда)
	
	Элементы.ТабличныйДокументДанные.ТолькоПросмотр = Ложь;
	Элементы.ФормаВыполнитьАнализ.Доступность = Истина;
	СброситьНаСервере(ТабличныйДокументДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СброситьНаСервере(ТабличныйДокументДанные)
	
	ИмяОбласти = СтрШаблон(
		"R1C1:R%1C4", Формат(ТабличныйДокументДанные.ВысотаТаблицы, "ЧГ="));
	Область = ТабличныйДокументДанные.Область(ИмяОбласти);
	ТабличныйДокументДанные.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);

КонецПроцедуры

&НаСервере
Процедура ВыполнитьАнализНаСервере()
	
	// Структура макета фиксированная, вывод в 2 ТД: первый - заголовки, второй - данные.
	// 2 ТД пришлось из-за копирования-вставки из LibreOffice (при вставке затиралась колонка-заголовок).
	// 1 колонка - ТС 
	// 2 колонка - Показатель1 (может быть пустым)
	// 3 колонка - Показатель2 (может быть пустым)
	// 4 колонка - Показатель3 (может быть пустым)
	
	// Получить список ТС из Табличного документа
	ТранспортныеСредства = ВыделитьТранспортныеСредства();
	
	// Получить показатели из Табличного документа
	СоответствиеПоказателей = ВыделитьПоказателиИзТабличногоДокумента();
	Если СоответствиеПоказателей.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Заполните хотя бы один показатель в первой строке документа!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	Показатели = Новый Массив;
	Для Каждого КлючИЗначение Из СоответствиеПоказателей Цикл
		Показатели.Добавить(КлючИЗначение.Значение);
	КонецЦикла;
	
	РезультатЗапроса = РезультатЗапросаВнешнихПробПоЗаявкамНаПеревозку(Показатели, ТранспортныеСредства);
	РезультатыВнешнихПроб = РезультатЗапроса.Выгрузить();
	
	ПодготовитьДанныеТабличногоДокументаДляСравнения(СоответствиеПоказателей);
    
	// Обход первичных данных
	НомерКолонкиТС = 1;
	Для Каждого Показатель Из СоответствиеПоказателей Цикл 
		
		НомерПервойСтроки = 1;
		Для НомерСтроки = НомерПервойСтроки По ТабличныйДокументДанные.ВысотаТаблицы Цикл
			
			ОбластьТС 			= ТабличныйДокументДанные.Область(НомерСтроки, НомерКолонкиТС);
			ОбластьПоказатель 	= ТабличныйДокументДанные.Область(НомерСтроки, Показатель.Ключ);
			
			Отбор = Новый Структура("НомерТС,Показатель", ОбластьТС.Текст, Показатель.Значение);
			ТекущееЗначение = ТекущееЗначениеВнешнейПробыПоДаннымИБ(РезультатыВнешнихПроб, Отбор);
			
			ВыделитьРасхождениеПоЗначениямДляОбласти(ОбластьПоказатель, ТекущееЗначение);
			
			ОбластьПоказатель.Текст = СтрШаблон("%1 / %2", ОбластьПоказатель.Текст, ТекущееЗначение);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Элементы.ТабличныйДокументДанные.ТолькоПросмотр = Истина;
	Элементы.ФормаВыполнитьАнализ.Доступность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеТабличногоДокументаДляСравнения(Знач СоответствиеПоказателей)
	
	Для Каждого Показатель Из СоответствиеПоказателей Цикл 
		
		Для НомерСтроки = 1 По ТабличныйДокументДанные.ВысотаТаблицы Цикл 
			
			Область = ТабличныйДокументДанные.Область(НомерСтроки, Показатель.Ключ);
			Область.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			Область.ЦветТекста 	= Новый Цвет;
			Область.Шрифт 		= Новый Шрифт;
			Текст 				= ?(ПустаяСтрока(Область.Текст), "-", Область.Текст);
			Если СтрНайти(Область.Имя, ":") Тогда 
				// Область объединенная: разъединить и заполнить значения в ячейках
				Область.Разъединить();
				Для НПП = Область.Верх По Область.Низ Цикл 
					ОбластьЗначения = ТабличныйДокументДанные.Область(НПП, Показатель.Ключ);
					ОбластьЗначения.Текст = Текст;
				КонецЦикла;
				
				НомерСтроки = Область.Низ;
				
			Иначе 
				Область.Текст = Текст;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ВыделитьРасхождениеПоЗначениямДляОбласти(ОбластьПоказатель, ТекущееЗначение)
	
	ОписаниеТипа 	= Новый ОписаниеТипов("Число");
	ВнешнееЗначение = ОбластьПоказатель.Текст;
	Если Не ОписаниеТипа.ПривестиЗначение(ВнешнееЗначение) = ОписаниеТипа.ПривестиЗначение(ТекущееЗначение) Тогда
		ОбластьПоказатель.ЦветТекста = ЦветаСтиля.ЦветТекстаОтрицательногоЗначения;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекущееЗначениеВнешнейПробыПоДаннымИБ(РезультатыВнешнихПроб, Отбор)
	
	ДанныеВнешнейПробы = РезультатыВнешнихПроб.НайтиСтроки(Отбор);
	Если ДанныеВнешнейПробы.Количество() = 0 Тогда
		ТекущееЗначение = "-";
	Иначе
		ТекущееЗначение = Формат(ДанныеВнешнейПробы[0].ЗначениеПоказателя, "ЧДЦ=2; ЧН=0,00");
	КонецЕсли;
	Возврат ТекущееЗначение
	
КонецФункции

&НаСервере
Функция РезультатЗапросаВнешнихПробПоЗаявкамНаПеревозку(Показатели, ТранспортныеСредства)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
	Запрос.УстановитьПараметр("НазначениеИспользованияКачества", НазначениеИспользованияКачества);
	Запрос.УстановитьПараметр("Показатели", Показатели);
	Запрос.УстановитьПараметр("ТранспортныеСредства", ТранспортныеСредства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерЗаявки КАК НомерЗаявки,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерТС КАК НомерТС,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НазначениеИспользованияКачества КАК НазначениеИспользованияКачества,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.Показатель КАК Показатель,
	|	ВнешниеПробыПоЗаявкамНаПеревозку.ЗначениеПоказателя КАК ЗначениеПоказателя
	|ИЗ
	|	РегистрСведений.гкс_ВнешниеПробыПоЗаявкамНаПеревозку КАК ВнешниеПробыПоЗаявкамНаПеревозку
	|ГДЕ
	|	ВнешниеПробыПоЗаявкамНаПеревозку.НомерЗаявки = &НомерЗаявки
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.НазначениеИспользованияКачества = &НазначениеИспользованияКачества
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.Показатель В(&Показатели)
	|	И ВнешниеПробыПоЗаявкамНаПеревозку.НомерТС В(&ТранспортныеСредства)";
	Возврат Запрос.Выполнить();
	
КонецФункции

&НаСервере
Функция ВыделитьПоказателиИзТабличногоДокумента()
	
	СоответствиеПоказателей = Новый Соответствие;
	
	Область = ТабличныйДокумент.Область("R1C2");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область("R1C3");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Область = ТабличныйДокумент.Область("R1C4");
	Если ЗначениеЗаполнено(Область.Значение) Тогда 
		СоответствиеПоказателей.Вставить(Область.Право, Область.Значение);
	КонецЕсли;
	
	Возврат СоответствиеПоказателей;
	
КонецФункции

&НаСервере
Функция ВыделитьТранспортныеСредства()
	
	ТранспортныеСредства = Новый Массив;
	Для НомерСтроки = 1 По ТабличныйДокументДанные.ВысотаТаблицы Цикл 
		
		ИмяОбласти = СтрШаблон("R%1C1", Формат(НомерСтроки, "ЧГ="));
		ОбластьТС = ТабличныйДокументДанные.Область(ИмяОбласти);
		Если ЗначениеЗаполнено(ОбластьТС.Текст) Тогда 
			ТранспортныеСредства.Добавить(ОбластьТС.Текст);
		КонецЕсли;
		
	КонецЦикла;
	Возврат ТранспортныеСредства;

КонецФункции

#КонецОбласти
